taskt/Core/Automation/Commands/WindowGroup/IWindowHandleProperties_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.IWindowHandleProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromWindowHandleByXPathCommands" [ label="ADescendantsSearchUIElementsFromWindowHandleByXPathCommands", style="dashed", ];
"taskt.Core.Automation.Commands.IWindowHandleProperties" [ label="IWindowHandleProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromWindowHandleByTreeWalkerCommands" [ label="ADescendantsSearchUIElementsFromWindowHandleByTreeWalkerCommands", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationUIElementActionAfterSearchUIElementByXPathFromWindowHandleCommand" [ label="UIAutomationUIElementActionAfterSearchUIElementByXPathFromWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationUIElementActionAfterSearchUIElementFromWindowHandleCommand" [ label="UIAutomationUIElementActionAfterSearchUIElementFromWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.IWindowHandleActionPropeties" [ label="IWindowHandleActionPropeties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.AWindowHandleCommands" [ label="AWindowHandleCommands", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationSearchUIElementFromWindowHandleByXPathCommand" [ label="UIAutomationSearchUIElementFromWindowHandleByXPathCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchAnyUIElementFromWindowHandleByTreeWalkerCommands" [ label="ADescendantsSearchAnyUIElementFromWindowHandleByTreeWalkerCommands", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationSearchUIElementsInformationFromWindowHandleCommand" [ label="UIAutomationSearchUIElementsInformationFromWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.AWindowHandleActionCommands" [ label="AWindowHandleActionCommands", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationGetWindowUIElementFromWindowHandleCommand" [ label="UIAutomationGetWindowUIElementFromWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationSearchUIElementsTreeXMLFromWindowHandleCommand" [ label="UIAutomationSearchUIElementsTreeXMLFromWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ActivateWindowByWindowHandleCommand" [ label="ActivateWindowByWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CheckWindowHandleExistsCommand" [ label="CheckWindowHandleExistsCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetProcessNameFromWindowHandleCommand" [ label="GetProcessNameFromWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetWindowNameFromWindowHandleCommand" [ label="GetWindowNameFromWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetWindowPositionFromWindowHandleCommand" [ label="GetWindowPositionFromWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetWindowSizeFromWindowHandleCommand" [ label="GetWindowSizeFromWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetWindowStateFromWindowHandleCommand" [ label="GetWindowStateFromWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationSearchUIElementFromWindowHandleCommand" [ label="UIAutomationSearchUIElementFromWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.EnterKeysFromWindowHandleCommand" [ label="EnterKeysFromWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.EnterShortcutKeyFromWindowHandleCommand" [ label="EnterShortcutKeyFromWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SendAdvancedKeyStrokesFromWindowHandleCommand" [ label="SendAdvancedKeyStrokesFromWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CloseWindowByWindowHandle" [ label="CloseWindowByWindowHandle", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.MoveWindowByWindowHandleCommand" [ label="MoveWindowByWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ResizeWindowByWindowHandleCommand" [ label="ResizeWindowByWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SetWindowStateByWindowHandleCommand" [ label="SetWindowStateByWindowHandleCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromWindowHandleByXPathCommands" -> "taskt.Core.Automation.Commands.IWindowHandleProperties";
"taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromWindowHandleByTreeWalkerCommands" -> "taskt.Core.Automation.Commands.IWindowHandleProperties";
"taskt.Core.Automation.Commands.UIAutomationUIElementActionAfterSearchUIElementByXPathFromWindowHandleCommand" -> "taskt.Core.Automation.Commands.IWindowHandleProperties";
"taskt.Core.Automation.Commands.UIAutomationUIElementActionAfterSearchUIElementFromWindowHandleCommand" -> "taskt.Core.Automation.Commands.IWindowHandleProperties";
"taskt.Core.Automation.Commands.IWindowHandleActionPropeties" -> "taskt.Core.Automation.Commands.IWindowHandleProperties";
"taskt.Core.Automation.Commands.AWindowHandleCommands" -> "taskt.Core.Automation.Commands.IWindowHandleProperties";
"taskt.Core.Automation.Commands.UIAutomationSearchUIElementFromWindowHandleByXPathCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromWindowHandleByXPathCommands";
"taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchAnyUIElementFromWindowHandleByTreeWalkerCommands" -> "taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromWindowHandleByTreeWalkerCommands";
"taskt.Core.Automation.Commands.UIAutomationSearchUIElementsInformationFromWindowHandleCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromWindowHandleByTreeWalkerCommands";
"taskt.Core.Automation.Commands.AWindowHandleActionCommands" -> "taskt.Core.Automation.Commands.IWindowHandleActionPropeties";
"taskt.Core.Automation.Commands.UIAutomationGetWindowUIElementFromWindowHandleCommand" -> "taskt.Core.Automation.Commands.AWindowHandleCommands";
"taskt.Core.Automation.Commands.UIAutomationSearchUIElementsTreeXMLFromWindowHandleCommand" -> "taskt.Core.Automation.Commands.AWindowHandleCommands";
"taskt.Core.Automation.Commands.AWindowHandleActionCommands" -> "taskt.Core.Automation.Commands.AWindowHandleCommands";
"taskt.Core.Automation.Commands.ActivateWindowByWindowHandleCommand" -> "taskt.Core.Automation.Commands.AWindowHandleCommands";
"taskt.Core.Automation.Commands.CheckWindowHandleExistsCommand" -> "taskt.Core.Automation.Commands.AWindowHandleCommands";
"taskt.Core.Automation.Commands.GetProcessNameFromWindowHandleCommand" -> "taskt.Core.Automation.Commands.AWindowHandleCommands";
"taskt.Core.Automation.Commands.GetWindowNameFromWindowHandleCommand" -> "taskt.Core.Automation.Commands.AWindowHandleCommands";
"taskt.Core.Automation.Commands.GetWindowPositionFromWindowHandleCommand" -> "taskt.Core.Automation.Commands.AWindowHandleCommands";
"taskt.Core.Automation.Commands.GetWindowSizeFromWindowHandleCommand" -> "taskt.Core.Automation.Commands.AWindowHandleCommands";
"taskt.Core.Automation.Commands.GetWindowStateFromWindowHandleCommand" -> "taskt.Core.Automation.Commands.AWindowHandleCommands";
"taskt.Core.Automation.Commands.UIAutomationSearchUIElementFromWindowHandleCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchAnyUIElementFromWindowHandleByTreeWalkerCommands";
"taskt.Core.Automation.Commands.EnterKeysFromWindowHandleCommand" -> "taskt.Core.Automation.Commands.AWindowHandleActionCommands";
"taskt.Core.Automation.Commands.EnterShortcutKeyFromWindowHandleCommand" -> "taskt.Core.Automation.Commands.AWindowHandleActionCommands";
"taskt.Core.Automation.Commands.SendAdvancedKeyStrokesFromWindowHandleCommand" -> "taskt.Core.Automation.Commands.AWindowHandleActionCommands";
"taskt.Core.Automation.Commands.CloseWindowByWindowHandle" -> "taskt.Core.Automation.Commands.AWindowHandleActionCommands";
"taskt.Core.Automation.Commands.MoveWindowByWindowHandleCommand" -> "taskt.Core.Automation.Commands.AWindowHandleActionCommands";
"taskt.Core.Automation.Commands.ResizeWindowByWindowHandleCommand" -> "taskt.Core.Automation.Commands.AWindowHandleActionCommands";
"taskt.Core.Automation.Commands.SetWindowStateByWindowHandleCommand" -> "taskt.Core.Automation.Commands.AWindowHandleActionCommands";
}
